---
title: SweptProfile
classe: Autodesk.Revit.DB.SweptProfile
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# SweptProfile

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double EndSetBack { get; }` | `sweptProfile.EndSetBack` | Double |
| `Boolean IsValidObject { get; }` | `sweptProfile.IsValidObject` | Boolean |
| `Double StartSetBack { get; }` | `sweptProfile.StartSetBack` | Double |
| `Void Dispose()` | `sweptProfile.Dispose()` | Void |
| `Curve GetDrivingCurve()` | `sweptProfile.GetDrivingCurve()` | Curve |
| `Profile GetSweptProfile()` | `sweptProfile.GetSweptProfile()` | Profile |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```